MindScienceSkills/fluid_dynamics/fluid_dynamics/hpc-openfoam/assets/templates/pimplefoam-minimal/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;

    // Uncomment and tune for harder transients:
    // residualControl
    // {
    //     U
    //     {
    //         tolerance   1e-5;
    //         relTol      0;
    //     }
    //     p
    //     {
    //         tolerance   1e-5;
    //         relTol      0;
    //     }
    // }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
    }
}

// ************************************************************************* //
// NOTE: If enabling RAS turbulence, add k and epsilon solver blocks
// and uncomment relaxation factors for them.  Typical pattern for kEpsilon:
//
// --- uncomment for RAS turbulence ---
// solvers
// {
//     p  { $p; }
//     pFinal { $pFinal; }
//     U  { $U; }
//     k
//     {
//         solver          PBiCGStab;
//         preconditioner  DIC;
//         tolerance       1e-8;
//         relTol          0.1;
//     }
//     epsilon
//     {
//         solver          PBiCGStab;
//         preconditioner  DIC;
//         tolerance       1e-8;
//         relTol          0.1;
//     }
//     nut { solver diffusion; tolerance 1e-8; relTol 0; }
// }
// relaxationFactors
// {
//     fields { p 0.3; }
//     equations
//     {
//         U 0.7;
//         k 0.7;
//         epsilon 0.7;
//     }
// }
// --- end RAS turbulence block ---
